merlokk/ai-remote/approver-esp32/sdkconfig.defaults
# The committed half of the configuration (CLAUDE.md §10.14.4): the real
# `sdkconfig` is generated by `idf.py set-target esp32c6` and is not committed.

CONFIG_IDF_TARGET="esp32c6"

# 16 MB of flash. The default table assumes 2 or 4 MB, which this one overflows.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# The layout in partitions.csv — two 2.5 MB OTA slots, the rest storage (§10.12).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# C++ without exceptions or RTTI (§10.14.1). Both are already the IDF default;
# they are written down so a menuconfig session cannot flip them by accident.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# The console — logs and the §10.7 command line — goes to the chip's own USB
# Serial/JTAG, which is what the board's USB-C is wired to. There is no UART
# bridge on this board, so leaving the default UART console means a silent port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
